app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id") VALUES('2011-01-17 03:52:35', 'Testing...', '2011-01-17 03:52:35', NULL)
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(params[:comment])