app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2011-01-14 07:29:47', 'meaning of "validates_presence_of"', 'So... "validates_presence_of :blah" means that ''this model throws up an error if :blah is blank/nul/etc.
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2011-01-14 07:23:01', "body" = 'This tutorial video goes way too fast.
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])